import React from 'react';

const PrivacyPolicyScreen = () => {
    return (
        <div style={{padding:'15px 20px'}}>
            <h2>Политика конфиденциальности</h2>
            <p>
                Добро пожаловать на страницу политики конфиденциальности компании Radio-Online.me.
            </p>
            <p>
                В Radio-Online.me мы придерживаемся принципов защиты вашей конфиденциальности и безопасности
                данных. В этой политике описано, как мы собираем, используем и защищаем вашу личную информацию.
            </p>
            <h5>Сбор и использование информации</h5>
            <p>
                Мы собираем информацию, необходимую для предоставления наших услуг и улучшения пользовательского
                опыта. Это может включать информацию, которую вы предоставляете нам при регистрации, использовании
                наших сервисов, или взаимодействии с нашими приложениями и сайтом.
            </p>
            <h5>Использование файлов cookie</h5>
            <p>
                Мы используем файлы cookie и аналогичные технологии для сбора определенной информации и улучшения
                функциональности нашего сайта. Файлы cookie позволяют нам запоминать ваши предпочтения и упрощают
                взаимодействие с нашим контентом.
            </p>
            <h5>Раскрытие информации третьим лицам</h5>
            <p>
                Мы не раскрываем вашу личную информацию третьим лицам без вашего согласия, за исключением случаев,
                предусмотренных законодательством.
            </p>
            <h5>Безопасность данных</h5>
            <p>
                Мы принимаем меры для защиты вашей личной информации и обеспечения безопасности данных. Однако,
                никакой метод передачи данных через интернет или метод электронного хранения не является абсолютно
                безопасным, и мы не можем гарантировать полную защиту данных.
            </p>
            <h5>Согласие с политикой</h5>
            <p>
                Используя наши услуги и взаимодействуя с нашим сайтом, вы соглашаетесь с условиями нашей политики
                конфиденциальности.
            </p>
        </div>
    );
};

export default PrivacyPolicyScreen;
